Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you'd like to consume records only written and committed inside a Kafka transaction you need to configure the `isolation.level` property on the incoming channel as such:
ja_jp: Kafka トランザクション内で書き込まれ、コミットされたレコードのみを使用する場合は、着信チャネルの `isolation.level` プロパティーを以下のように設定する必要があります。

source: If you'd like to skip the token verification when the public endpoint methods are invoked then please disable the xref:security-built-in-authentication-support-concept.adoc#proactive-authentication[proactive authentication].
ja_jp: パブリックエンドポイントメソッドが呼び出されたときにトークンの検証をスキップする場合は、xref:security-built-in-authentication-support-concept.adoc#proactive-authentication[プロアクティブ認証] を無効にしてください。

source: If you'd like to skip the token verification when the public endpoint methods are invoked then please disable the xref:security-built-in-authentication.adoc#proactive-authentication[proactive authentication].
ja_jp: パブリックエンドポイントメソッドが呼び出されたときにトークンの検証をスキップする場合は、xref:security-built-in-authentication.adoc#proactive-authentication[プロアクティブ認証] を無効にしてください。

source: If you'd like to skip the token verification when the public endpoint methods are invoked, disable the xref:security-proactive-authentication.adoc[proactive authentication].
ja_jp: パブリックエンドポイントメソッド呼び出し時のトークン検証を省略したい場合は、 xref:security-proactive-authentication.adoc[プロアクティブ認証] を無効にします。

source: If you're creating a typical Quarkus application (e.g., HTTP-based services) that includes command-line functionality, you'll need to handle the application's lifecycle differently. In the `Runnable.run()` method of your command, make sure to use `Quarkus.waitForExit()` or `Quarkus.asyncExit()`. This will prevent the application from shutting down prematurely and ensure a proper shutdown process.
ja_jp: コマンドライン機能を含む一般的なQuarkusアプリケーション（HTTPベースのサービスなど）を作成する場合は、アプリケーションのライフサイクルを異なる方法で処理する必要があります。 コマンドの `Runnable.run()` メソッドでは、必ず `Quarkus.waitForExit()` または `Quarkus.asyncExit()` を使用してください。これにより、アプリケーションが早期にシャットダウンされるのを防ぎ、適切なシャットダウン処理を行うことができます。

source: If you're interested in it, you can read the xref:hibernate-search-orm-elasticsearch.adoc[Hibernate Search with Elasticsearch guide].
ja_jp: 興味のある方は、 link:hibernate-search-orm-elasticsearch.html[Hibernate Search with Elasticsearchのガイド] をお読みください。

source: If you're looking for information how to make a Quarkus extension configurable then see the <<writing-extensions.adoc#configuration,Writing Your Own Extension>> guide.
ja_jp: Quarkus エクステンションを設定可能にする方法については、link:writing-extensions.html#configuration[独自のエクステンションの作成] ガイドを参照してください。

source: If you're looking for information how to make a Quarkus extension configurable then see the xref:writing-extensions.adoc#configuration[Writing Your Own Extension] guide.
ja_jp: Quarkusエクステンションを設定可能にする方法をお探しの場合は、 xref:writing-extensions.adoc#configuration[独自のエクステンションの作成] ガイドをご覧ください。

source: If you're migrating from 0.3.x, here are the key breaking changes:
ja_jp: 0.3.xから移行する場合、主な破壊的な変更点は次のとおりです。

source: If you're new to CDI then we recommend you to read the xref:cdi.adoc[Introduction to CDI] first.
ja_jp: CDI が初めての方は、最初に xref:cdi.adoc[コンテキストと依存性注入(CDI)の紹介] を読むことをお勧め致します。

source: If you're new to CDI we recommend you to read the xref:cdi.adoc[Introduction to CDI] first.
ja_jp: CDI が初めての方は、最初に xref:cdi.adoc[コンテキストと依存性注入(CDI)の紹介] を読むことを推奨します。

source: If you're running a remote Docker daemon, you need to replace `quarkus.native.container-build=true` with `quarkus.native.remote-container-build=true`.
ja_jp: リモートDockerデーモンを実行している場合、 `-Dquarkus.native.container-build=true` を `-Dquarkus.native.remote-container-build=true` で置換する必要があります。

source: If you're to investigate some differences in detail make sure to check what Quarkus is invoking exactly: when the build plugin is producing a native image, the full command lines are logged.
ja_jp: いくつかの差異を詳細に調査する場合は、Quarkusが呼び出しているものを正確にチェックしてください。ビルドプラグインがネイティブイメージを生成しているときには、コマンドライン全体がログに記録されます。

source: If you're upgrading from 1.0.0.Alpha1, you'll need to make the following changes:
ja_jp: 1.0.0.Alpha1 からアップグレードする場合は、以下の変更を行う必要があります。

source: If you're using Mac M1, an extra step is required to https://edofic.com/posts/2021-09-12-podman-m1-amd64[make AMD64 images work]:
ja_jp: Mac M1 を使用している場合、 https://edofic.com/posts/2021-09-12-podman-m1-amd64[AMD64 イメージを動作させる] ための手順が追加で必要になります:

source: If you're using Podman 4.1 or higher, you don't need the `-v $HOME:$HOME` volume mount.
ja_jp: Podman 4.1 以降を使用している場合、 `-v $HOME:$HOME` のボリュームマウントは必要ありません。

source: If you're using a blocking data access to the database, you can safely block on the link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html[`WebAuthnSecurity`] methods, with `.await().indefinitely()`, because nothing is async in the `register` and `login` methods, besides the data access with your link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`].
ja_jp: データベースへのブロッキングデータアクセスを使用している場合、 link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html[`WebAuthnSecurity`] メソッドは、 `.await().indefinitely()` で安全にブロックできます。なぜなら、 `register` および `login` メソッドでは、link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] を介した データアクセス以外は非同期処理が行われないからです。

source: If you're using a blocking data access to the database, you can safely block on the `WebAuthnSecurity` methods, with `.await().indefinitely()`, because nothing is async in the `register` and `login` methods, besides the data access with your `WebAuthnUserProvider`.
ja_jp: `WebAuthnSecurity` データベースへのデータアクセスにブロックを使っている場合、 `register` と `login` のメソッドでは、 `WebAuthnUserProvider` のデータアクセス以外に非同期なものはないので、 `.await().indefinitely()` のメソッドで、安全にブロックをすることができます。

source: If you're using repositories, then you will want to extend `PanacheMongoRepositoryBase` instead of `PanacheMongoRepository` and specify your ID type as an extra type parameter:
ja_jp: リポジトリを使用している場合は、 `PanacheMongoRepository` の代わりに `PanacheMongoRepositoryBase` を拡張し、ID 型を追加の型パラメータとして指定することになります。

source: If you're using repositories, then you will want to extend `PanacheRepositoryBase` instead of `PanacheRepository` and specify your ID type as an extra type parameter:
ja_jp: リポジトリを使用している場合は `PanacheRepository` の代わりに `PanacheRepositoryBase` を拡張し、IDの型を追加の型パラメーターとして指定することになります:

source: If you're using stateless sessions, you can also use the <<Jakarta Data>> type of repositories.
ja_jp: ステートレスセッションを使用している場合、<<Jakarta Data>> 型のリポジトリーも使用できます。

source: If you're using the REST Data with Panache extension to auto-generate your resources, you can still use the Security annotations within the package `javax.annotation.security`. For more information, see xref:rest-data-panache.adoc#securing-endpoints[Securing auto-generated resources].
ja_jp: REST Data with Panache エクステンションを使用してリソースを自動生成している場合でも、パッケージ `javax.annotation.security` 内の Security アノテーションを使用することができます。詳しくは、 link:rest-data-panache.html#securing-endpoints[自動生成されたリソースの保護] を参照してください。

source: If you're using the `@CacheResult` annotation on a method in your Java sources, we automatically suggest the settings available to configure it from your configuration file. It's also fairly reactive to changes so you'll always know if something has gone wrong.
ja_jp: Javaソースのメソッドに `@CacheResult` アノテーションを使用している場合、設定ファイルからそのメソッドを構成するために利用可能な設定を自動的に提案します。また、変更に対してかなり敏感に反応するので、何か問題が発生したときにいつでも知ることができます。

source: If you've followed the build native image guide, you should have a local container image named `quarkus-quickstart/getting-started`.
ja_jp: ビルドネイティブイメージガイドに従っていれば、 `quarkus-quickstart/getting-started` という名前のローカルコンテナーイメージがあるはずです。

source: If your Bearer tokens are in a JWT format, you can use either of the three extensions. Both `quarkus-oidc` and `quarkus-smallrye-jwt` support refreshing the JsonWebKey (JWK) set when the OpenID Connect provider rotates the keys. Therefore, if remote token introspection must be avoided or is unsupported by the providers, use `quarkus-oidc` or `quarkus-smallrye-jwt` for verifying JWT tokens.
ja_jp: ベアラートークンがJWT形式の場合、3つのエクステンションのいずれかを使用することができます。 `quarkus-oidc` と `quarkus-smallrye-jwt` は、OpenID Connect プロバイダがキーをローテーションする際に JsonWebKey (JWK) セットを更新することをサポートしています。したがって、リモートトークンイントロスペクションを避ける必要がある場合やプロバイダがサポートしていない場合は、JWTトークンの検証に `quarkus-oidc` または `quarkus-smallrye-jwt` を使用します。

source: If your Bearer tokens must be verified, use `quarkus-oidc`, `quarkus-smallrye-jwt`, or `quarkus-elytron-security-oauth2`.
ja_jp: ベアラートークンを検証する必要がある場合は、 `quarkus-oidc` , `quarkus-smallrye-jwt` , または `quarkus-elytron-security-oauth2` を使用してください。

source: If your Kafka broker uses OAuth as authentication mechanism, you need to configure the Kafka consumer to enable this authentication process. First, add the following dependency to your application:
ja_jp: Kafka ブローカーが認証メカニズムとして OAuth を使用している場合は、この認証プロセスを有効にするために Kafka コンシューマーを設定する必要があります。まず、以下の依存関係をアプリケーションに追加します。

source: If your Kafka consumer is batch based, you will need to send a batch of messages to the channel as by creating them manually.
ja_jp: Kafka コンシューマーがバッチベースの場合は、手動でメッセージを作成して、バッチメッセージをチャネルに送信する必要があります。

source: If your OpenID Connect provider, such as Keycloak, supports a token revocation endpoint, you can use `OidcClient#revokeAccessToken` to revoke the current access token. The revocation endpoint URL is discovered alongside the token request URI or can be configured with `quarkus.oidc-client.revoke-path`.
ja_jp: Keycloak などの OpenID Connect プロバイダーがトークンの失効エンドポイントをサポートしている場合、 `OidcClient#revokeAccessToken` を使用して現在のアクセストークンを失効させることができます。失効エンドポイントの URL は、トークン要求 URI と共に検出されるか、または `quarkus.oidc-client.revoke-path` で設定することができます。

source: If your OpenId Connect provider such as Keycloak supports a token revocation endpoint then `OidcClient#revokeAccessToken` can be used to revoke the current access token. The revocation endpoint URL will be discovered alongside the token request URI or can be configured with `quarkus.oidc-client.revoke-path`.
ja_jp: Keycloak などの OpenId Connect プロバイダがトークンの失効エンドポイントをサポートしている場合、 `OidcClient#revokeAccessToken` を使うことで現在のアクセストークンを失効させることができます。失効エンドポイントの URL は、トークン要求 URI と共に検出されるか、または `quarkus.oidc-client.revoke-path` で設定することができます。

source: If your OpenId Connect provider, such as Keycloak, supports a token revocation endpoint, then `OidcClient#revokeAccessToken` can be used to revoke the current access token. The revocation endpoint URL will be discovered alongside the token request URI or can be configured with `quarkus.oidc-client.revoke-path`.
ja_jp: Keycloak などの OpenId Connect プロバイダーがトークンの失効エンドポイントをサポートしている場合、 `OidcClient#revokeAccessToken` を使うことで現在のアクセストークンを失効させることができます。失効エンドポイントの URL は、トークン要求 URI と共に検出されるか、または `quarkus.oidc-client.revoke-path` で設定することができます。

source: If your Quarkus Security architecture includes Quarkus REST (formerly RESTEasy Reactive) and Jackson, Quarkus can limit the fields included in JSON serialization based on the configured security. For more information, see the xref:rest.adoc#secure-serialization[JSON serialization] section of the Quarkus “Writing REST services with Quarkus REST (formerly RESTEasy Reactive)” guide.
ja_jp: Quarkus Security アーキテクチャーに Quarkus REST (旧称 RESTEasy Reactive) と Jackson が含まれている場合、Quarkus は設定されたセキュリティーに基づいて JSON シリアライゼーションに含まれるフィールドを制限できます。 詳細は、Quarkus の「Quarkus REST (旧称 RESTEasy Reactive) を使用した REST サービスの作成」ガイドの xref:rest.adoc#secure-serialization[JSON シリアライゼーション] セクションを参照してください。

source: If your Quarkus Security architecture includes RESTEasy Reactive and Jackson, Quarkus can limit the fields that are included in JSON serialization based on the configured security. For more information, see xref:resteasy-reactive.adoc#secure-serialization[Writing REST services with RESTEasy Reactive].
ja_jp: Quarkus SecurityアーキテクチャにRESTEasy ReactiveとJacksonが含まれている場合、Quarkusでは、設定されたセキュリティに基づいて、JSONシリアライズに含まれるフィールドを制限できます。詳細については、 xref:resteasy-reactive.adoc#secure-serialization[RESTEasy Reactiveを使用したRESTサービスの作成] を参照してください。

source: If your Quarkus application is deployed on a Kubernetes or OpenShift cluster with link:https://github.com/redhat-developer/service-binding-operator[Service Binding Operator] and link:https://github.com/redhat-developer/app-services-operator/tree/main/docs[OpenShift Application Services] operators installed, configurations necessary to access Red Hat OpenShift Streams for Apache Kafka and Service Registry can be injected to the application using xref:deploying-to-kubernetes.adoc#service_binding[Kubernetes Service Binding].
ja_jp: Quarkus アプリケーションが、link:https://github.com/redhat-developer/service-binding-operator[Service Binding Operator] および link:https://github.com/redhat-developer/app-services-operator/tree/main/docs[OpenShift Application Services] オペレーターをインストールした Kubernetes または OpenShift クラスターにデプロイされている場合、Red Hat OpenShift Streams for Apache Kafka と Service Registry へのアクセスに必要な設定は、xref:deploying-to-kubernetes.adoc#service_binding[Kubernetes Service Binding] を使用してアプリケーションに注入することができます。

source: If your Quarkus application is running in a docker container then it may share a network interface with a Keycloak docker container launched by DevServices for Keycloak, with the Quarkus application and Keycloak communicating with each other via an internal shared docker network.
ja_jp: QuarkusアプリケーションがDockerコンテナで実行されている場合、DevServices for Keycloakで起動したKeycloak dockerコンテナとネットワークインターフェースを共有し、QuarkusアプリケーションとKeycloakが内部共有Dockerネットワーク経由で相互に通信することがあります。

source: If your Quarkus application is running in a docker container, it may share a network interface with a Keycloak docker container launched by DevServices for Keycloak, with the Quarkus application and Keycloak communicating with each other via an internal shared docker network.
ja_jp: QuarkusアプリケーションがDockerコンテナで実行されている場合、DevServices for Keycloakによって起動されたKeycloak dockerコンテナとネットワークインターフェースを共有し、QuarkusアプリケーションとKeycloakは内部の共有Dockerネットワークを通じて互いに通信することができます。

source: If your Quarkus application needs to authenticate users using the OIDC Authorization Code Flow, you must use the OpenID Connect extension. For more information, refer to the xref:security-oidc-code-flow-authentication.adoc[OIDC Code Flow Mechanism for Protecting Web Applications].
ja_jp: Quarkus アプリケーションで OIDC 認可コードフローを使用してユーザーを認証する必要がある場合は、OpenID Connect エクステンションを使用する必要があります。 詳細については、xref:security-oidc-code-flow-authentication.adoc[Web アプリケーションを保護するための OIDC コードフローメカニズム] を参照してください。

source: If your Quarkus application runs in a Docker container, it might share a network interface with a Keycloak container started by DevServices for Keycloak. In this scenario, the Quarkus application and Keycloak communicate through an internal shared Docker network.
ja_jp: Quarkus アプリケーションが Docker コンテナー内で実行される場合、DevServices for Keycloak によって起動された Keycloak コンテナーとネットワークインターフェイスを共有する可能性があります。 このシナリオでは、Quarkus アプリケーションと Keycloak は内部の共有 Docker ネットワークを介して通信します。

source: If your Quarkus build references system properties that do not start with `quarkus.` (or environment variables that do not start with `QUARKUS_`), you must reference those via the Quarkus build extension. For example, if your `application.properties` file references an environment variable like this:
ja_jp: Quarkus ビルドが `quarkus.` で始まらないシステムプロパティー (または `QUARKUS_`で始まらない環境変数) を参照する場合は、Quarkus ビルドエクステンションを介して参照する必要があります。たとえば、 `application.properties` ファイルが次のような環境変数を参照するとします。

source: If your SMTP requires a trust store, you can configure the trust store as follows:
ja_jp: SMTPにtrust storeが必要な場合は、以下のようにtrust storeを設定します。

source: If your `@Transactional`-annotated method returns a reactive value, such as:
ja_jp: もし, `@Transactional` アノテーション付与されたメソッドが、次のようなリアクティブな値を返す場合:

source: If your `Map` value is a complex type, then just continue the notation by adding the property to set at the end.
ja_jp: `Map` の値が複雑な型であれば、最後に set するプロパティーを追加して表記を続けるだけです。

source: If your `templates` directory includes sub-directories, use `templates/=templates/**/*` instead.
ja_jp: `templates` ディレクトリーにサブディレクトリーが含まれている場合は、代わりに `templates/=templates/**/*` を使用してください。

source: If your application contains Kotlin classes annotated with `jakarta.enterprise.context.ApplicationScoped` for example, then `<option>all-open:annotation=jakarta.enterprise.context.ApplicationScoped</option>` needs to be added as well. Same goes for any class that needs to have a dynamic proxy created at runtime, like a JPA Entity class.
ja_jp: 例えば、 `jakarta.enterprise.context.ApplicationScoped` でアノテーションされた Kotlin クラスがアプリケーションに含まれている場合、 `<option>all-open:annotation=jakarta.enterprise.context.ApplicationScoped</option>` も追加する必要があります。JPAエンティティクラスのように、実行時に動的プロキシを作成する必要があるクラスも同様です。

source: If your application contains Kotlin classes annotated with `jakarta.enterprise.context.ApplicationScoped` for example, then `<option>all-open:annotation=jakarta.enterprise.context.ApplicationScoped</option>` needs to be added as well. Same goes for any class that needs to have a dynamic proxy created at runtime.
ja_jp: 例えば、アプリケーションに `jakarta.enterprise.context.ApplicationScoped` でアノテーションされた Kotlin クラスが含まれている場合、 `<option>all-open:annotation=jakarta.enterprise.context.ApplicationScoped</option>` も追加する必要があります。実行時に動的プロキシを作成する必要があるクラスも同様です。

source: If your application contains Kotlin classes annotated with `javax.enterprise.context.ApplicationScoped` for example, then `<option>all-open:annotation=javax.enterprise.context.ApplicationScoped</option>` needs to be added as well. Same goes for any class that needs to have a dynamic proxy created at runtime.
ja_jp: 例えば、アプリケーションに `javax.enterprise.context.ApplicationScoped` のアノテーションが付いたクラスがある場合、 `<option>all-open:annotation=javax.enterprise.context.ApplicationScoped</option>` も追加する必要があります。実行時にダイナミックプロキシーを作成する必要があるクラスについても同様です。

source: If your application contains classes annotated with `javax.enterprise.context.ApplicationScoped` for example, then `<option>all-open:annotation=javax.enterprise.context.ApplicationScoped</option>` needs to be added as well. Same goes for any class that needs to have a dynamic proxy created at runtime.
ja_jp: 例えば、アプリケーションに `javax.enterprise.context.ApplicationScoped` のアノテーションが付いたクラスがある場合、 `<option>all-open:annotation=javax.enterprise.context.ApplicationScoped</option>` も追加する必要があります。実行時にダイナミックプロキシーを作成する必要があるクラスについても同様です。

source: If your application does not need to use access tokens but only interact with the authenticated user who must always re-authenticate when the session expires, consider `quarkus.oidc.token-state-manager.strategy=idtoken` - which retains ID token only, ignoring both access and refresh tokens.
ja_jp: アプリケーションがアクセストークンを使用する必要がなく、セッションが期限切れになった際に常に再認証が必要なユーザーとの対話のみを行う場合は、`quarkus.oidc.token-state-manager.strategy=idtoken` を検討してください。これは ID トークンのみを保持し、アクセストークンとリフレッシュトークンの両方を無視します。

source: If your application does not use any Quarkus extension that exposes an HTTP server, you can still configure the probes to directly use the gRPC Health service by adding the property `quarkus.kubernetes.readiness-probe.grpc-action-enabled=true` into your configuration:
ja_jp: HTTP サーバーを公開する Quarkus エクステンションをアプリケーションが使用していない場合でも、設定にプロパティー `quarkus.kubernetes.readiness-probe.grpc-action-enabled=true` を追加することで、プローブが gRPC Health サービスを直接使用するように設定できます。

source: If your application has a simple entity (e.g. `Person`) and a repository (e.g. `PersonRepository`) that implements either `PanacheMongoRepository` or `PanacheMongoRepositoryBase` interface, you could instruct REST Data with Panache to generate its JAX-RS resource with the following interface:
ja_jp: アプリケーションが単純なエンティティー(例: `Person` )と、 `PanacheMongoRepository` または `PanacheMongoRepositoryBase` インターフェイスを実装したリポジトリ(例: `PersonRepository` )を持っている場合、REST Data with Panache に、以下のインターフェイスを使用して JAX-RS リソースを生成するように指示することができます。

source: If your application has a simple entity (e.g. `Person`) and a repository (e.g. `PersonRepository`) that implements either `PanacheMongoRepository` or `PanacheMongoRepositoryBase` interface, you could instruct REST Data with Panache to generate its Jakarta REST resource with the following interface:
ja_jp: アプリケーションにシンプルなエンティティ（例： `Person` ）と、 `PanacheMongoRepository` または `PanacheMongoRepositoryBase` インターフェースを実装するリポジトリ（例： `PersonRepository` ）がある場合、REST Data with Panache に指示して、次のインターフェイスで Jakarta REST リソースを生成させることができます:

source: If your application has a simple entity (e.g. `Person`) and a repository (e.g. `PersonRepository`) that implements either `PanacheRepository` or `PanacheRepositoryBase` interface, you could instruct REST Data with Panache to generate its JAX-RS resource with the following interface:
ja_jp: アプリケーションが単純なエンティティー(例: `Person` )と、 `PanacheRepository` または `PanacheRepositoryBase` インターフェイスを実装したリポジトリ(例: `PersonRepository` )を持っている場合、REST Data with Panache に、以下のインターフェイスを使用して JAX-RS リソースを生成するように指示することができます。

source: If your application has a simple entity (e.g. `Person`) and a repository (e.g. `PersonRepository`) that implements either `PanacheRepository` or `PanacheRepositoryBase` interface, you could instruct REST Data with Panache to generate its Jakarta REST resource with the following interface:
ja_jp: アプリケーションにシンプルなエンティティ（例： `Person` ）と、 `PanacheRepository` または `PanacheRepositoryBase` インターフェースを実装するリポジトリ（例： `PersonRepository` ）がある場合、REST Data with Panache に指示して、次のインターフェイスで Jakarta REST リソースを生成させることができます:

source: If your application has an entity (e.g. `Person`) that extends either `PanacheEntity` or `PanacheEntityBase` class, you could instruct REST Data with Panache to generate its JAX-RS resource with the following interface:
ja_jp: アプリケーションに `PanacheEntity` または `PanacheEntityBase` クラスを拡張したエンティティー ( `Person` など) がある場合、REST Data with Panache に、次のインターフェイスを使用して JAX-RS リソースを生成するように指示することができます。

source: If your application has an entity (e.g. `Person`) that extends either `PanacheEntity` or `PanacheEntityBase` class, you could instruct REST Data with Panache to generate its Jakarta REST resource with the following interface:
ja_jp: アプリケーションに `PanacheEntity` または `PanacheEntityBase` クラスを拡張したエンティティ (例: `Person` ) がある場合、REST Data with Panache に指示して、次のインターフェイスで Jakarta REST リソースを生成させることができます:

source: If your application has an entity (e.g. `Person`) that extends either `PanacheMongoEntity` or `PanacheMongoEntityBase` class, you could instruct REST Data with Panache to generate its JAX-RS resource with the following interface:
ja_jp: アプリケーションに `PanacheMongoEntity` または `PanacheMongoEntityBase` クラスを拡張したエンティティー ( `Person` など) がある場合、REST Data with Panache に、次のインターフェイスを使用して JAX-RS リソースを生成するように指示することができます。

source: If your application has an entity (e.g. `Person`) that extends either `PanacheMongoEntity` or `PanacheMongoEntityBase` class, you could instruct REST Data with Panache to generate its Jakarta REST resource with the following interface:
ja_jp: アプリケーションに `PanacheMongoEntity` または `PanacheMongoEntityBase` クラスを拡張したエンティティ (例: `Person` ) がある場合、REST Data with Panache に指示して、次のインターフェイスで Jakarta REST リソースを生成させることができます:

source: If your application involves a substantial number of static resources, consider using a CDN. Both the Web Bundler and Quinoa can be configured to work seamlessly with a CDN, providing improved performance and distribution of assets.
ja_jp: アプリケーションに大量の静的リソースが含まれる場合は、CDN の使用を検討してください。Web Bundler と Quinoa はどちらも CDN とシームレスに連携するように設定できるため、アセットのパフォーマンスと配布が向上します。

source: If your application is deployed across multiple domains, make sure to set a `quarkus.oidc.authentication.cookie-domain` property for the session cookie be visible to all protected Quarkus services, for example, if you have 2 services deployed at:
ja_jp: アプリケーションが複数のドメインにデプロイされている場合は、セッション Cookie の `quarkus.oidc.authentication.cookie-domain` プロパティーを設定して、保護されているすべての Quarkus サービスに表示されるようにしてください。たとえば、次の場所に 2 つのサービスがデプロイされている場合です。
